# THIS FILE IS AUTOMATICALLY GENERATED
# Project: Z:\ATTECH\UTILITY Dep\PCB-OVEN\PCB-OVEN\PSOC\PCB oven controller.cydsn\PCB oven controller.cyprj
# Date: Sun, 31 Jul 2022 19:32:36 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 169 339} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for Z:\ATTECH\UTILITY Dep\PCB-OVEN\PCB-OVEN\PSOC\PCB oven controller.cydsn\TopDesign\TopDesign.cysch
# Project: Z:\ATTECH\UTILITY Dep\PCB-OVEN\PCB-OVEN\PSOC\PCB oven controller.cydsn\PCB oven controller.cyprj
# Date: Sun, 31 Jul 2022 19:32:31 GMT
